## Plan Result (stg-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw"
        name                = "aks00-aat-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/em-hrs-ingestor"
          ~ name         = "em-hrs-ingestor" -> "em-ped-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/dg-docassembly"
          ~ name         = "dg-docassembly" -> "em-hrs-ingestor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/dm-store"
          ~ name         = "dm-store" -> "dg-docassembly"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/dm-store-staging"
          ~ name         = "dm-store-staging" -> "dm-store"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/bulk-scan-payment-processor"
          ~ name         = "bulk-scan-payment-processor" -> "dm-store-staging"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/bulk-scan-processor"
          ~ name         = "bulk-scan-processor" -> "bulk-scan-payment-processor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/bulk-scan-sample-app"
          ~ name         = "bulk-scan-sample-app" -> "bulk-scan-processor"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/bulk-scan-orchestrator"
          ~ name         = "bulk-scan-orchestrator" -> "bulk-scan-sample-app"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/reform-scan-blob-router"
          ~ name         = "reform-scan-blob-router" -> "bulk-scan-orchestrator"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/reform-scan-notification-service"
          ~ name         = "reform-scan-notification-service" -> "reform-scan-blob-router"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-data-store-api"
          ~ name         = "ccd-data-store-api" -> "reform-scan-notification-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-definition-store-api"
          ~ name         = "ccd-definition-store-api" -> "ccd-data-store-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-user-profile-api"
          ~ name         = "ccd-user-profile-api" -> "ccd-definition-store-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-test-stubs-service"
          ~ name         = "ccd-test-stubs-service" -> "ccd-user-profile-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-case-print-service"
          ~ name         = "ccd-case-print-service" -> "ccd-test-stubs-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-case-activity-api"
          ~ name         = "ccd-case-activity-api" -> "ccd-case-print-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-admin-web"
          ~ name         = "ccd-admin-web" -> "ccd-case-activity-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-case-document-am-api"
          ~ name         = "ccd-case-document-am-api" -> "ccd-admin-web"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccd-message-publisher"
          ~ name         = "ccd-message-publisher" -> "ccd-case-document-am-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/aac-manage-case-assignment"
          ~ name         = "aac-manage-case-assignment" -> "ccd-message-publisher"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ctsc-work-allocation"
          ~ name         = "ctsc-work-allocation" -> "aac-manage-case-assignment"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-terms-and-conditions"
          ~ name         = "xui-terms-and-conditions" -> "ctsc-work-allocation"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-activity-tracker-api"
          ~ name         = "xui-activity-tracker-api" -> "xui-terms-and-conditions"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/bar-api"
          ~ name         = "bar-api" -> "xui-activity-tracker-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-professional-api"
          ~ name         = "rd-professional-api" -> "bar-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-user-profile-api"
          ~ name         = "rd-user-profile-api" -> "rd-professional-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-profile-sync"
          ~ name         = "rd-profile-sync" -> "rd-user-profile-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-judicial-api"
          ~ name         = "rd-judicial-api" -> "rd-profile-sync"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-caseworker-ref-api"
          ~ name         = "rd-caseworker-ref-api" -> "rd-judicial-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-location-ref-api"
          ~ name         = "rd-location-ref-api" -> "rd-caseworker-ref-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rd-commondata-api"
          ~ name         = "rd-commondata-api" -> "rd-location-ref-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rpe-send-letter-service"
          ~ name         = "rpe-send-letter-service" -> "rd-commondata-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccpay-bulkscanning-api"
          ~ name         = "ccpay-bulkscanning-api" -> "rpe-send-letter-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/payment-api"
          ~ name         = "payment-api" -> "ccpay-bulkscanning-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/fees-register-api"
          ~ name         = "fees-register-api" -> "payment-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccpay-refunds-api"
          ~ name         = "ccpay-refunds-api" -> "fees-register-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/ccpay-notifications-service"
          ~ name         = "ccpay-notifications-service" -> "ccpay-refunds-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/cmc-claim-store"
          ~ name         = "cmc-claim-store" -> "ccpay-notifications-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/fact-api"
          ~ name         = "fact-api" -> "cmc-claim-store"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/nfdiv-case-api"
          ~ name         = "nfdiv-case-api" -> "fact-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/idam-api"
          ~ name         = "idam-api" -> "nfdiv-case-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/idam-web-admin"
          ~ name         = "idam-web-admin" -> "idam-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/rse-check"
          ~ name         = "rse-check" -> "idam-web-admin"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/civil-service"
          ~ name         = "civil-service" -> "rse-check"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-workflow-api"
          ~ name         = "wa-workflow-api" -> "civil-service"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-task-management-api"
          ~ name         = "wa-task-management-api" -> "wa-workflow-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/dg-docmosis"
          ~ name         = "dg-docmosis" -> "wa-task-management-api"
            # (2 unchanged attributes hidden)
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "dg-docmosis"
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/em-hrs-ingestor"
          ~ name                                = "em-hrs-ingestor" -> "em-ped-api"
          ~ probe_name                          = "em-hrs-ingestor" -> "em-ped-api"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/dg-docassembly"
          ~ name                                = "dg-docassembly" -> "em-hrs-ingestor"
          ~ probe_name       

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

            = "sscs-evidence-share"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/sscs-tribunals-api" -> null
          - backend_address_pool_name  = "sscs-tribunals-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/sscs-tribunals-api" -> null
          - backend_http_settings_name = "sscs-tribunals-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/sscs-tribunals-api" -> null
          - http_listener_name         = "sscs-tribunals-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/sscs-tribunals-api" -> null
          - name                       = "sscs-tribunals-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/sscs-tribunals-api"
          + backend_address_pool_name  = "sscs-tribunals-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/sscs-tribunals-api"
          + backend_http_settings_name = "sscs-tribunals-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/sscs-tribunals-api"
          + http_listener_name         = "sscs-tribunals-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/sscs-tribunals-api"
          + name                       = "sscs-tribunals-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/sscs-tya-notif" -> null
          - backend_address_pool_name  = "sscs-tya-notif" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/sscs-tya-notif" -> null
          - backend_http_settings_name = "sscs-tya-notif" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/sscs-tya-notif" -> null
          - http_listener_name         = "sscs-tya-notif" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/sscs-tya-notif" -> null
          - name                       = "sscs-tya-notif" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/sscs-tya-notif"
          + backend_address_pool_name  = "sscs-tya-notif"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/sscs-tya-notif"
          + backend_http_settings_name = "sscs-tya-notif"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/sscs-tya-notif"
          + http_listener_name         = "sscs-tya-notif"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/sscs-tya-notif"
          + name                       = "sscs-tya-notif"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-task-management-api" -> null
          - backend_address_pool_name  = "wa-task-management-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/wa-task-management-api" -> null
          - backend_http_settings_name = "wa-task-management-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/wa-task-management-api" -> null
          - http_listener_name         = "wa-task-management-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/wa-task-management-api" -> null
          - name                       = "wa-task-management-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-task-management-api"
          + backend_address_pool_name  = "wa-task-management-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/wa-task-management-api"
          + backend_http_settings_name = "wa-task-management-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/wa-task-management-api"
          + http_listener_name         = "wa-task-management-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/wa-task-management-api"
          + name                       = "wa-task-management-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-workflow-api" -> null
          - backend_address_pool_name  = "wa-workflow-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/wa-workflow-api" -> null
          - backend_http_settings_name = "wa-workflow-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/wa-workflow-api" -> null
          - http_listener_name         = "wa-workflow-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/wa-workflow-api" -> null
          - name                       = "wa-workflow-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/wa-workflow-api"
          + backend_address_pool_name  = "wa-workflow-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/wa-workflow-api"
          + backend_http_settings_name = "wa-workflow-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/wa-workflow-api"
          + http_listener_name         = "wa-workflow-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/wa-workflow-api"
          + name                       = "wa-workflow-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-activity-tracker-api" -> null
          - backend_address_pool_name  = "xui-activity-tracker-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/xui-activity-tracker-api" -> null
          - backend_http_settings_name = "xui-activity-tracker-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/xui-activity-tracker-api" -> null
          - http_listener_name         = "xui-activity-tracker-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/xui-activity-tracker-api" -> null
          - name                       = "xui-activity-tracker-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-activity-tracker-api"
          + backend_address_pool_name  = "xui-activity-tracker-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/xui-activity-tracker-api"
          + backend_http_settings_name = "xui-activity-tracker-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/xui-activity-tracker-api"
          + http_listener_name         = "xui-activity-tracker-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/xui-activity-tracker-api"
          + name                       = "xui-activity-tracker-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-terms-and-conditions" -> null
          - backend_address_pool_name  = "xui-terms-and-conditions" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/xui-terms-and-conditions" -> null
          - backend_http_settings_name = "xui-terms-and-conditions" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/xui-terms-and-conditions" -> null
          - http_listener_name         = "xui-terms-and-conditions" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/xui-terms-and-conditions" -> null
          - name                       = "xui-terms-and-conditions" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendAddressPools/xui-terms-and-conditions"
          + backend_address_pool_name  = "xui-terms-and-conditions"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/backendHttpSettingsCollection/xui-terms-and-conditions"
          + backend_http_settings_name = "xui-terms-and-conditions"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/httpListeners/xui-terms-and-conditions"
          + http_listener_name         = "xui-terms-and-conditions"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw/requestRoutingRules/xui-terms-and-conditions"
          + name                       = "xui-terms-and-conditions"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "em-ped-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "em-ped-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "em-ped-api"
          + id                         = (known after apply)
          + name                       = "em-ped-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (223 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1275,"Program":"tfcmt","SHA1":"","Target":"stg-cftapps_cluster_lb_backend","Vars":{}} -->